1. Создать коллекцию products и заполнить документами (6 штук) со следующими свойствами (_id, title, price, count). Используйте следующие данные

1 Велосипед 45000 12
2 Самокат 1500 10
3 Ролики 2000 20
4 Лыжи 22000 15
5 Скейт 19000 4
6 Сноуборд 33000 17


2.У всех товаров, кол-во которых меньше 10, задайте кол-во 10

У всех товаров, цена которых меньше 20000 увеличьте цену на 5000

Добавить свойство страны (country) а в качестве значения пустой массив. Свойство в дальнейшем будет содержать страны поставщиков

Товарам с id 1 и 4 добавить в качестве поставщика(в массив country) Испанию

Товарам с id 1 и 3 добавить в качестве поставщиков Америку и Бразилию

Товару с id 2 добавьте в качестве поставщика Японию, Корею и Китай

Для товара "Ролики" убрать поставщика Америка

Всем товарам добавить свойство quality со значением 0

Товарам которые стоят больше 20000 установить в свойстве quality значение 10

Товарам которые стоят не больше 20000 установить в свойстве quality значение 5

Удалить поле count для всех товаров

Всем товарам добавить в качестве поставщиков Францию и Италию

Для товаров с id 1, 3 и 6 удалить поставщика Италия
